mkaradeli/Metu-X-stm32/CM7/app/app_main.cpp
/*
 * app_main.cpp
 *
 *  Created on: May 14, 2026
 *      Author: karadeli
 */

#include "globals.hpp"   // HWIL_ENABLED lives here now, shared with UserTask.cpp
#define DISABLE_CRC false
#define CHECK_TIMER_FREQUENCIES false
#define BENCH_TEST false   // MUST be false before flight -- see its use below (AltitudeEstimator sigmaAccel bump)

#include <shared_memory.h>
#include "app_main.hpp"
#include "main.h"
#include "i2c.h"
#include "spi.h"
#include "ring_buffer.h"
#include <string.h>
#include "task_timer.h"
#include "PressureSensor.hpp"
#include "globals.hpp"
#include "Button.hpp"
#include "string.h"
#include "UserTask.hpp"
#include "MissionUart.hpp"

#include "MissionControl.hpp"
#include "YModem/YModem.hpp"
#include "UsbMsc/UsbMsc.hpp"
//#include "platformController.h"

#include "BNO085.hpp"
#include "SdCard/sd_task.hpp"
//#include "SdCardRaw.hpp"
#include "nrf24.h"
#include "nrf24_link.h"
#include "nrf24_port.h"
BNO085 imu;

/* Plain (non-static) mirrors of the driver's internal counters, refreshed
 * every tick in tim7_trigger() - watch these in Live Expressions while
 * running. nrf24.c and nrf24_link.c each keep their own stats in a static
 * s_stats, same name in both files, which Live Expressions can't address
 * unambiguously by name; these globals sidestep that. */
nrf24_stats_t      nrf24_radio_stats;   /* per-fragment: tx_ok, tx_dropped, tx_timeout, rx_ok, retransmits, lost_packets */
nrf24_link_stats_t nrf24_frame_stats;   /* per-frame: frames_sent, frames_dropped, frags_sent, frames_rx, crc_errors, reassembly_drops */
uint32_t           nrf24_uplink_rx_count   = 0u;   /* ACK-payload uplink packets drained, see tim7_trigger() */
uint32_t           nrf24_uplink_bad_frames = 0u;   /* wrong length or CRC-16 mismatch, dropped                */
uint32_t           nrf24_uplink_dup_drops  = 0u;   /* repeat of an already-processed seq, ignored              */

/* Purely differentiated from AltitudeEstimator::lastProjectedHeight() -- no
 * IMU, no Kalman. Set in onLidarFrame(), read by tim12_trigger() instead of
 * g_altEst.velocity(). */
float lidarDerivedVelocity = 0.0f;

/* Go/no-go: bit set = subsystem currently healthy. Recomputed every 100 ms in
 * LED_Counter_Tick(); MissionControl::Start() ANDs this against
 * missionControl.go_no_go_enabled to decide whether arming is allowed. */
uint8_t  go_no_go_status = 0u;
#define IMU_STALE_MS    200u   /* IMU reports at 200-400 Hz; way past one period if stale */
#define LIDAR_STALE_MS  300u   /* lidar repeats ~100/s per MissionUart.cpp's own estimate  */
static uint32_t s_last_imu_ok_tick   = 0u;
static uint32_t s_last_lidar_ok_tick = 0u;

/* Battery: 6S LiPo, sensed on adc_dma_buf_pressure[5] through a 1/21 divider.
 * BATTERY_ADC_VREF_V assumes VREF+ = VDDA = 3.3 V (no VREFBUF override found
 * in this project) -- if the board's analog reference is actually something
 * else, this threshold is silently wrong by that same ratio. Verify against
 * a real multimeter reading before trusting this gate. */
#define BATTERY_DIVIDER_RATIO   21.0f
#define BATTERY_ADC_VREF_V      3.3f
#define BATTERY_MIN_VOLTS       23.0f   /* ~25% SoC cutoff for a 6S pack */
#define BATTERY_RAW_MIN         ((uint16_t)((BATTERY_MIN_VOLTS / BATTERY_DIVIDER_RATIO \
                                  / BATTERY_ADC_VREF_V) * 65535.0f + 0.5f))

/* Ground uplink command wire format -- MUST match rf24_gateway.py's CMD_*
 * opcodes / VERB table and CMD_STRUCT ("<BBIH" + crc16, little-endian).
 * Delivered as a raw nRF24 ACK payload (nrf24_rx_read() below), NOT our own
 * nrf24_link fragment format:
 *
 *   byte 0    seq       wraps at 256; gateway repeats a command 3x on the
 *                       same seq so one lost ACK payload doesn't lose it
 *   byte 1    cmd       opcode, see UPLINK_CMD_* below
 *   byte 2..5 echo_ts   last telemetry timestamp the gateway had seen (u32 LE)
 *   byte 6..7 arg       opcode-specific argument (u16 LE)
 *   byte 8..9 crc16     CRC-16/CCITT-FALSE seed 0xFFFF over bytes 0..7, LE
 */
#define UPLINK_CMD_LEN        10u
#define UPLINK_CMD_NOP        0x00u
#define UPLINK_CMD_SEL        0x10u
#define UPLINK_CMD_ARM        0x11u
#define UPLINK_CMD_START      0x12u
#define UPLINK_CMD_STOP       0x20u
#define UPLINK_CMD_ABORT      0x21u
#define UPLINK_CMD_DISCHARGE  0x30u
#define UPLINK_CMD_SHUTDOWN   0x40u
#define UPLINK_CMD_SET_GONOGO 0x50u   /* arg low byte = new go_no_go_enabled mask */

static bool    s_have_last_cmd_seq = false;
static uint8_t s_last_cmd_seq = 0;

/* Dispatch one validated uplink command directly against MissionControl's
 * API -- no ASCII round-trip through HandleCommand(). The one safety property
 * that mattered there (ARM/START only fires if the operator's confirmation
 * names the mission currently SELECTed) is preserved as a plain index
 * compare: `arg == SelectedIndex()` is the binary-native equivalent of
 * HandleCommand()'s ieq(arg, SelectedName()) check, and unlike the old
 * missionTable[arg].name lookup it needs no bounds check at all -- arg is
 * never used to index anything here, so an out-of-range value just fails the
 * compare instead of ever risking an out-of-bounds read.
 *
 * Each case calls exactly what HandleCommand() itself calls underneath
 * (direct Start()/End()/Select() vs. the ISR-safe Request* variants for
 * discharge/shutdown), so this is not a change in ISR-safety -- only in how
 * the command gets there. */
static void uplink_cmd_dispatch(uint8_t cmd, uint16_t arg)
{
	switch (cmd) {
	case UPLINK_CMD_NOP:
		return;

	case UPLINK_CMD_SEL: {
		bool ok = missionControl.Select((uint8_t)arg);
		if (ok) printf("SEL %u OK\r\n", (unsigned)arg);
		else    printf("SEL %u FAIL: %s\r\n", (unsigned)arg,
		                MissionControl::ErrorText(missionControl.last_error));
		return;
	}

	case UPLINK_CMD_ARM:
	case UPLINK_CMD_START: {
		if (arg != missionControl.SelectedIndex()) {
			printf("ARM FAIL: arg %u != selected %u\r\n",
			       (unsigned)arg, (unsigned)missionControl.SelectedIndex());
			return;
		}
		/* Start(true): arms normally from IDLE, same as button/UART; if
		 * already ARMED and waiting on the pin, this repeat of the same
		 * confirmed command instead fires it over telemetry -- the
		 * software equivalent of pulling the safety connector. See
		 * MissionControl::Start()'s telemetryFire parameter. */
		bool ok = missionControl.Start(true);
		if (ok) printf("ARM %s OK\r\n", missionControl.SelectedName());
		else    printf("ARM %s FAIL: %s\r\n", missionControl.SelectedName(),
		                MissionControl::ErrorText(missionControl.last_error));
		return;
	}

