mkaradeli/Metu-X-stm32/CM7/app/app_main.cpp
	case UPLINK_CMD_STOP:
	case UPLINK_CMD_ABORT:
		missionControl.End();
		printf("STOP/ABORT: state=%s\r\n", missionControl.StateName());
		return;

	case UPLINK_CMD_DISCHARGE:
		missionControl.RequestSafeDischarge();
		printf("DISCHARGE requested\r\n");
		return;

	case UPLINK_CMD_SHUTDOWN:
		missionControl.RequestShutdown();
		printf("SHUTDOWN requested\r\n");
		return;

	case UPLINK_CMD_SET_GONOGO:
		/* Doesn't move hardware, just changes what's allowed to gate a
		 * later ARM. */
		missionControl.go_no_go_enabled = (uint8_t)(arg & 0xFFu);
		printf("GONOGO enabled=0x%02X\r\n", missionControl.go_no_go_enabled);
		return;

	default:
		return;
	}
}


#define FRACTIONAL(x) int(floor(int((x)*100)))%100
#define LOG_TERMINATOR  0x0A0Du   /* LF,CR packed MSB-first */

//#define PI 3.1415926536f

// TODO: PS sensor 3 encodere yakin olan
// TODO: PS sensor 0 alttaki
void LED_Counter_Tick(void);


// TODO: islemci acilma sirasinda akim sensorlerini sifirlayacak.


volatile uint64_t micros_overflow=0;
float load;
//uint32_t local_sensor_data_dropped=0;



void current_adc_complete();
void encoder_adc_complete();
void pressure_adc_complete();

task_timer_t test_point_gpio = {5000,0};
task_timer_t button_task = {1,0};
task_timer_t IMU_task = {1,0};
task_timer_t sd_card_task = {500,0};
task_timer_t printf_task = {1, 0};
task_timer_t heartbeat_task = {100, 0}; // period ms, start ms

task_timer_t uart_logging = { 2, 0};
task_timer_t nrf24_tx_task = {10, 0};   // 50 Hz downlink
task_timer_t baro_task = {10, 0};       // 100 Hz, matches Barometer::init()'s ODR (NORMAL mode)

__attribute__((section(".sram3"), used))
volatile uint16_t adc_dma_buf_current[5];
__attribute__((section(".sram3"), used))
volatile uint16_t adc_dma_buf_encoder[8*4];
__attribute__((section(".sram3"), used))
volatile uint16_t adc_dma_buf_pressure[6];

uint32_t timeOfLastPrint=uwTick;




DebouncedButton Button{1,BUTTON_USER_GPIO_PORT,BUTTON_USER_PIN};
DebouncedButton SafetyConnector{false,SAFETY_CONNECTOR_GPIO_Port,SAFETY_CONNECTOR_Pin};
volatile float load_filtered;
uint16_t crc16_calc(const uint8_t *p, size_t n);
bool mount_ok;
bool file_creation_ok;
float time_sec = 0;
int load_cell_counter = 0;

SensorData_t local_sensor_data{'K','D'};
SensorData_t * last_valid_sensor_data = 0;

void onImuReport(const BNO085& r);
void onLidarFrame(uint16_t distMm, uint16_t strength);

LowPass load_lpf{1.0f, 1000,1};  // 30 Hz cutoff @ 1 kHz sample rate
LowPass accel_interval{1.0f, 1000,1};  // 30 Hz cutoff @ 1 kHz sample rate
LowPass quatIntRV_interval{1.0f,1000,1};

Profiler free_profiler{"free"};
Profiler load_cell_profiler{"load"};
Profiler main_loop_profiler{"main"};
Profiler printf_profiler{"prin"};
Profiler adc1_profiler{"enco"};
Profiler adc2_profiler{"curr"};
Profiler adc3_profiler{"pres"};
Profiler tim2_profiler{"tim2"};
Profiler tim3_profiler{"tim3"};
Profiler tim4_profiler{"tim4"};
Profiler button_profiler{"butt"};
Profiler crc_profiler{"crc_"};
Profiler IMU_profiler{"IMU_"};
Profiler nrf24_profiler{"nrf2"};
Profiler sd_card_profiler{"sd_c"};
Profiler tim7_profiler{"tim7"};
Profiler kf_profiler{"kf_p"};
Profiler tim12_profiler{"tim1"};
Profiler hwil_profiler{"hwil"};
Profiler lidar_profiler{"lidr"};
Profiler baro_profiler{"baro"};

Profiler *profilers[] = {
		&free_profiler,
		&load_cell_profiler,
		&main_loop_profiler,
		&printf_profiler,
		&adc1_profiler,
		&adc2_profiler,
		&adc3_profiler,
		&tim2_profiler,
		&tim3_profiler,
		&tim4_profiler,
		&button_profiler,
		&crc_profiler,
		&IMU_profiler,
		&nrf24_profiler,
		&sd_card_profiler,
		&tim7_profiler,
		&kf_profiler,
		&tim12_profiler,
		&hwil_profiler,
		&lidar_profiler,
		&baro_profiler,
};


float battery_voltage = 0;
//bool True = true;
//MissionControl missionControl(&True,
//			&logData.record);
MissionControl missionControl(&logData.ready, &logData.record);

//platformController platform_controller;



/* Called by MissionControl the moment a mission is triggered, before
 * log_recording goes true. Wire it to your f_expand pre-allocation. */
//static void logPrepareHook(uint32_t estimated_duration_ms, const char *header)
//{
//    const uint32_t bytes_per_s = 1000u * sizeof(SensorData_t);   // ~1 kHz logging
//    const uint32_t bytes = (estimated_duration_ms / 1000u) * bytes_per_s;
////    sd_log_prepare(bytes, header);      // your sd_task API
//
//}
static uint32_t calStartTick = 0;   // set right after beginCalibration()

/* One-shot bring-up diagnostic: sweeps every 7-bit address on I2C4 and
 * reports which ones ACK. Blocking (HAL_I2C_IsDeviceReady), only meant to
 * run once at startup -- not for the hot path. If this finds nothing,
 * the problem is upstream of software (power/ground/continuity), not the
 * BMP581's address. */
static void i2c4_bus_scan() {
	printf("I2C4 bus scan:\r\n");
	int found = 0;
	for (uint8_t addr7 = 1; addr7 < 0x7F; addr7++) {
		if (HAL_I2C_IsDeviceReady(&hi2c4, static_cast<uint16_t>(addr7) << 1, 2, 5) == HAL_OK) {
			printf("  ACK at 0x%02X\r\n", addr7);
			found++;
		}
	}
	if (found == 0) printf("  no devices responded -- check power/ground/wiring, not just address\r\n");
}

void app_init() {
	SensorData_Buffer_Init(&logData);

	for (int i = 0; i<4; i++){
		for (int j=0; j<11; j++){
			actuator[i].actuatorController.rtU.ValveFitPressureRatios[j] = ValveFitPressureRatios[i][j];
		}
		actuator[i].actuatorController.rtU.nozzle_gain = nozzle_gain[i];
	}
//	Button.DebouncedButton(1);
	logData.ready=false;
//	logData.record = false;
//	SensorData_Buffer_Init(&logData_axiram);
	HAL_ADCEx_Calibration_Start(&hadc2, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED);
	  HAL_ADC_Start_DMA(&hadc2, (uint32_t*)adc_dma_buf_current, 5);

	  HAL_ADCEx_Calibration_Start(&hadc1, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED);
	  HAL_ADC_Start_DMA(&hadc1, (uint32_t*)adc_dma_buf_encoder, 32);

	  HAL_ADCEx_Calibration_Start(&hadc3, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED);
	  HAL_ADC_Start_DMA(&hadc3, (uint32_t*)adc_dma_buf_pressure, 6);


	//  HAL_TIM_Base_Start(&htim3);
	  __HAL_TIM_SET_COUNTER(&htim2, htim2.Instance->ARR - 6);    // ~15 µs to first fire
	  __HAL_TIM_SET_COUNTER(&htim3, htim3.Instance->ARR - 36);   // ~45 µs
//	  actuator[0].actuatorController

