mkaradeli/Metu-X-stm32/CM7/app/app_main.cpp
#if CHECK_TIMER_FREQUENCIES
	  HAL_TIM_Base_Start_IT(&htim2);  /* pressure */
	  HAL_TIM_Base_Start_IT(&htim3);  /* current */
	  HAL_TIM_Base_Start_IT(&htim4);  /* encoder  */
#else
	  HAL_TIM_Base_Start(&htim2);  /* pressure */
	  HAL_TIM_Base_Start(&htim3);  /* current */
	  HAL_TIM_Base_Start(&htim4);  /* encoder  */
#endif
	  HAL_TIM_Base_Start_IT(&htim5);  /* _IT = interrupt ile */
	  HAL_TIM_Base_Start_IT(&htim12);  /* _IT = interrupt ile */


	  HAL_TIM_Base_Start(&htim1);  /* _IT = interrupt ile */

	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
      BSP_LED_On(LED_RED);

//	  actuator[0].setDuty(1.0f);
//	  motors[0].setDuty(1.0f);
      p.lever[2]   = 0.06f;
      p.sigmaAccel = 0.30f;
#if BENCH_TEST
      /* sigmaAccel sets how much the filter expects height uncertainty to
       * grow between lidar corrections, which sets the Kalman gain lidar
       * gets (P00 vs Rm) -- too small relative to the real accelerations
       * happening between updates, and P00 stays too tight, so even good
       * lidar corrections get under-weighted and the estimate lags real
       * fast motion. (Lidar is no longer outright rejected past a NIS
       * threshold -- see AltitudeEstimator::update() -- but this still
       * matters for how much influence it gets.) A hand-shake bench test
       * produces multi-g bursts the flight-tuned 0.30 doesn't model at all.
       * Bumped here so ground testing isn't lag-limited; MUST be back to
       * the flight value (BENCH_TEST 0) before flight. Starting point, not
       * a measured number. */
      p.sigmaAccel = 5.0f;
#endif
      g_altEst.configure(p);
	  if (!imu.begin(&hspi1)) {
//	          Error_Handler();
	      }
//	  imu.enableReport(SH2_RAW_ACCELEROMETER,  2500);
	  imu.enableReport(SH2_GYRO_INTEGRATED_RV, 2500);   // 400 Hz
	  imu.enableReport(SH2_ACCELEROMETER, 5000);   // 200 Hz

//	  imu.enableReport(SH2_GAME_ROTATION_VECTOR,2500);

	  /* nRF24 telemetry: downlinks local_sensor_data at 50 Hz, see
	   * nrf24_tx_task (app_loop) and nrf24_link_service() (tim7_trigger,
	   * 1 kHz). Auto-ack stays on so ground -> rocket commands can ride
	   * back on the ACK payload; ch/addr/data-rate must match the ground
	   * station config (see conversation history on that sync). */
	  {
	      nrf24_cfg_t nrf24_cfg;
	      nrf24_default_cfg(&nrf24_cfg);
	      nrf24_cfg.data_rate = NRF24_DR_2M;
	      nrf24_status_t nrf24_st = nrf24_init(&nrf24_cfg);
	      printf("nRF24: %s (status=%d)\r\n",
	             (nrf24_st == NRF24_OK) ? "OK, radio present" : "NOT FOUND",
	             (int)nrf24_st);
	      if (nrf24_st == NRF24_OK) {
	          nrf24_link_init(false);   /* auto-ack downlink */
	          nrf24_start_tx();
	      }
		  HAL_TIM_Base_Start_IT(&htim7);  /* micros() timebase -- must be running before imu.begin() so its internal sh2 timeouts can actually elapse */
	  }

		lidar.Reset();
		HAL_Delay(1000);  /* TF02-Pro needs ~1s after a system reset before it responds again (Benewake protocol manual) */
		uint8_t lidarFwVersion[3] = {0};
		bool lidarHealthy = lidar.HealthCheck(lidarFwVersion);
		printf("TF02-Pro lidar: %s\r\n",
		       lidarHealthy ? "OK" : "NOT RESPONDING (check USART6 wiring/power/baud)");
		if (lidarHealthy) {
			printf("TF02-Pro lidar firmware v%u.%u.%u\r\n",
			       lidarFwVersion[2], lidarFwVersion[1], lidarFwVersion[0]);
			lidar.SetOutputEnabled(false); // stop the live stream so the config ACKs below aren't lost to overrun
			lidar.SetUnitMm();
			lidar.SetFrameRate(1000);
			lidar.SetOutputEnabled(true);
			lidar.SaveConfig();
		}
//		altEstimator.begin();
		HAL_UARTEx_ReceiveToIdle_DMA(&huart6, lidar.getBuffer(), 128);

		bool baroHealthy = baro.init();
		printf("BMP581 baro: %s\r\n",
		       baroHealthy ? "OK" : "NOT RESPONDING (check I2C4 wiring/address)");
		if (!baroHealthy) i2c4_bus_scan();
//		if (baroHealthy) baro.startRead();  /* first read; re-armed from tim7_trigger()'s baro_task */
//	  dummy_init();
//	  printf(CLR_SCREEN);

//	    local_sensor_data.current_demand = 2;
//	    local_sensor_data.timestamp = 0;
//	    ready_to_write_a=0;
		for (int i=0; i<(sizeof(profilers)/sizeof(profilers[0])); i++)
			profilers[i]->reset();

	    HAL_Delay(10);
	    for (int i=0; i<4; i++)
	    	actuator[i].calibrate();
	    platform_controller.initialize();
	    hwil.initialize();
#if HWIL_ENABLED
	    /* Initial conditions, set once at boot -- not touched again per-tick.
	     * NOTE: since hwil.initialize() only runs once per power cycle, a
	     * second mission armed in the same session continues the simulated
	     * rocket from wherever the first mission's flight left off (position/
	     * velocity aren't reset back to X0/V0), rather than starting fresh.
	     * If that's not what you want, this needs to move to wherever a
	     * mission's Start() actually fires instead of here. */
	     hwil.rtU.V0 = 0.0f;   // rocket starts at rest
	     hwil.rtU.X0 = 2.0f;   // rocket starts at ground level
	     hwil.rtY.position = hwil.rtU.X0;
	     hwil.rtY.velocity = hwil.rtU.V0;

#endif
		for (int i= 0; i< 4; i++) {
			actuator[i].actuatorController.rtU.pos_feedback = actuator[i].hallEffect.valveAngle;
			actuator[i].actuatorController.rtU.SpeedFeedback = actuator[i].hallEffect.valveVelocity;
			actuator[i].actuatorController.rtU.P_manifold = Actuator::manifold->getPsi();
			actuator[i].actuatorController.rtU.P_nozzle_demand = 0.0F;

		}



	free_profiler.start();
//	missionControl.Init(taskFunction, shutdownFunction);
//	missionControl.actuator_mode_desired = actuator_mode_desired;
//	missionControl.system_mode_desired = system_modes::TESTFIRE;
//	missionControl.ops_duration_ms = ops_duration_ms;
//	missionControl.shutdown_duration_ms = shutdown_duration_ms;
//	missionControl.postShutdownWait_ms = postShutdownWait_ms;

    missionControl.Init();        // or Init();
    missionControl.Select(defaultMissionIndex);
    mission_uart_init(&huart3);       // whichever UART your ground link is on
    HilNavInit(&g_denizNav);   // alternate filter, logged only -- see globals.hpp


