mkaradeli/Metu-X-stm32/CM7/app/app_main.cpp
     baroHealthy = baro.init();
    printf("BMP581 baro: %s\r\n",
    		       baroHealthy ? "OK" : "NOT RESPONDING (check I2C4 wiring/address)");

    g_altEst.beginCalibration();
    calStartTick = uwTick;
    HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED4_GPIO_Port, LED4_Pin, GPIO_PIN_SET);

//	const uint8_t tv[] = "123456789";
//		uint16_t crc = crc16_calc(tv, 9);
//	controller_mode = controller_modes::POSITION;
}
extern "C" {
extern bool pc8_active;

}

volatile AltitudeEstimator::Status s;
bool selfTrigger = false;
float total_cpu_usage = 0;
bool altitudeEstimatorDone = false;
extern Profiler HWIL_STEP_profiler;
void app_loop() {
//	s = g_altEst.status();
	if (!altitudeEstimatorDone && (uwTick - calStartTick) >= 1500) {
	    if (g_altEst.finishCalibration()) {
	        altitudeEstimatorDone = true;
	        const auto& st = g_altEst.status();
	        printf("AltitudeEstimator calibrated: lidar=%s baro=%s\r\n",
	               st.lidarCalibratedAtStart ? "OK" : "MISSING",
	               st.baroCalibratedAtStart  ? "OK" : "MISSING");
	    } else {
	        calStartTick = uwTick;      // IMU not ready yet, keep collecting
	    }
	}
		main_loop_profiler.start();

	if (uwTick - timeOfLastPrint >= 1000){
		if (ymodem_active()) {
					/* This printf() block and GETLOG's binary YMODEM stream share
					 * the same ring buffer (common_print_buffer) -- interleaving
					 * them mid-transfer would corrupt blocks, not just add a
					 * stray line the ground tool can skip past. Hold the 1Hz
					 * timer at "now" instead of printing, so it resumes on a
					 * clean 1s cadence once the transfer ends rather than
					 * bursting out everything it missed. */
					timeOfLastPrint = uwTick;
				} else {
					timeOfLastPrint+= 1000;
					printf("timestamp = %ld\n\r", uwTick);
					total_cpu_usage = 0;
					for (int i=0; i<(sizeof(profilers)/sizeof(profilers[0])); i++){
						profilers[i]->metrics();
//						printf("%.4s cpu=%f, freq=%f\n\r",profilers[i]->name, profilers[i]->cpu_usage, profilers[i]->call_frequency);
						total_cpu_usage += profilers[i]->cpu_usage;
					}
					printf("%.4s cpu=%f, freq=%f\n\r",nrf24_profiler.name, nrf24_profiler.cpu_usage, nrf24_profiler.call_frequency);
					printf("%.4s cpu=%f, freq=%f\n\r",sd_card_profiler.name, sd_card_profiler.cpu_usage, sd_card_profiler.call_frequency);
					HWIL_STEP_profiler.metrics();
					printf("\ttotal cpu usage = %f\n\r", total_cpu_usage);
					printf("battery voltage = %f\n\r", battery_voltage);
		}
//		HWIL_STEP_profiler.metrics();
//		printf("total cpu usage = %f\n\r", total_cpu_usage);
//		printf("battery voltage = %f\n\r", battery_voltage);

	}
		main_loop_profiler.end();
	if (task_ready(&printf_task)) { // 1000 ms
		printf_profiler.start();
//		if (!ymodem_active()) {
		rb_flush();
//		}
		printf_profiler.end();
	  }

	if (task_ready(&sd_card_task)) { // 500 ms
		sd_card_profiler.start();
		sd_card_prep();
		sd_card_profiler.end();
	}
	sd_card_task_function(); // every iter

	/* Only safe context for this: FatFs has no reentrancy support and is
	 * otherwise exclusively driven from sd_card_prep()/sd_card_task_function()
	 * right above, both called from this same app_loop() iteration. */
	ymodem_poll();
	usb_msc_poll();

	if (task_ready(&nrf24_tx_task)) { // 20 ms, 50 Hz downlink
		if (nrf24_link_tx_idle()) {
			(void)nrf24_link_send(&local_sensor_data, sizeof(local_sensor_data));
		}
	}
//	battery_voltage = static_cast<float>(adc_dma_buf_pressure[5])/65536.0f *3.3f *21.0f;

}


void tim3_trigger(){
	tim3_profiler.start();
//	timer_counter_tim3+=1; /* Nucleo yeşil LED → PB0 */
	tim3_profiler.end();

}
void tim4_trigger(){
	tim4_profiler.start();
//	timer_counter_tim4 += 1;
	tim4_profiler.end();
}
void tim2_trigger(){
	tim2_profiler.start();
//	timer_counter_tim2 += 1;
	tim2_profiler.end();
}

void tim5_trigger(){
//	tim2_profiler.start();
	micros_overflow++;
//	tim2_profiler.end();
}
int tim7_counter = 0;
void tim7_trigger() { // 1 khz low priority
	tim7_counter++;
	tim7_profiler.start();
	if (true /*task_ready(&button_task)*/) { // 1ms
		Button.update();

		if (Button.pressed()) {
			button_profiler.start();
            missionControl.RequestToggle();     // ISR-safe, serviced in Iter()
            for (int i=0; i<(sizeof(profilers)/sizeof(profilers[0])); i++)
            			profilers[i]->reset();
		} else {
			if (selfTrigger and uwTick==10000) {
				selfTrigger = false;
	            missionControl.RequestToggle();     // ISR-safe, serviced in Iter()
			}
			button_profiler.end();
		}
	}
//	{ // safety connector
//		if (SafetyConnector.pressed()) {
//			missionControl.Toggle();
//		}
//	}
    mission_uart_poll();              // one DMA counter read when idle



//	rb_flush();
	if (task_ready(&IMU_task)) { // 1 ms
		IMU_profiler.start();
		imu.service();                 // poll at least every ~1 ms
		IMU_profiler.end();
	}
	if (task_ready(&baro_task)) { // 10 ms, 100 Hz
		baro_profiler.start();
		baro.startRead();  // non-blocking; no-op if a transfer is still in flight
		baro_profiler.end();
	}
	nrf24_profiler.start();
	(void)nrf24_link_service();        // pumps the TX fragment FIFO, never blocks longer than one SPI burst
	nrf24_get_stats(&nrf24_radio_stats);
	nrf24_link_get_stats(&nrf24_frame_stats);
	{
	    /* Ground-station commands ride in as raw ACK payloads (rf24_gateway.py's
	     * write_ack_payload() / <BBIH>+crc16 - NOT our own nrf24_link fragment
	     * format, so nrf24_rx_read() is the right API here, not nrf24_link_poll()).
	     * This MUST run every tick: with nothing draining it, 3 queued repeats of
	     * one command exactly fill the 3-deep RX FIFO, and once full it stays
	     * full until the radio is re-initialized - that's what silently killed
	     * the whole downlink the first time a command was sent. */
	    uint8_t pipe;
	    while (nrf24_rx_available(&pipe)) {
	        uint8_t cmd_buf[NRF24_MAX_PAYLOAD];
	        uint8_t n = nrf24_rx_read(cmd_buf, sizeof(cmd_buf));
	        nrf24_uplink_rx_count++;
	        (void)pipe;

	        if (n != UPLINK_CMD_LEN) {
	            nrf24_uplink_bad_frames++;
	            continue;
	        }
	        uint16_t crc_calc = nrf24_crc16_ccitt_false(cmd_buf, 8, 0xFFFFu);
	        uint16_t crc_rx   = (uint16_t)cmd_buf[8] | ((uint16_t)cmd_buf[9] << 8);
	        if (crc_calc != crc_rx) {
	            nrf24_uplink_bad_frames++;
	            continue;
	        }

	        uint8_t  seq = cmd_buf[0];
	        uint8_t  cmd = cmd_buf[1];
	        uint16_t arg = (uint16_t)cmd_buf[6] | ((uint16_t)cmd_buf[7] << 8);

	        /* rf24_gateway.py repeats every command 3x on the same seq so one
	         * lost ACK payload doesn't lose the command; dedup here so e.g.
	         * STOP/ABORT doesn't get processed three times over. */
	        if (s_have_last_cmd_seq && seq == s_last_cmd_seq) {
	            nrf24_uplink_dup_drops++;
	            continue;
	        }
	        s_have_last_cmd_seq = true;
	        s_last_cmd_seq = seq;

	        uplink_cmd_dispatch(cmd, arg);
	    }
	}
	nrf24_profiler.end();
	accel_interval.update(imu.accelInterval_us);
	quatIntRV_interval.update(imu.gyroIntegratedRVInterval_us);

    kf_profiler.start();
    {
        // Evaluate both flags separately: && would short-circuit and leave one
        // uncleared. Both are consume-on-read.
        const bool newQuat  = imu.hasNewQuaternion();
        const bool newAccel = imu.hasNewAccel();
        (void)newQuat;
        if (newAccel) {
        	onImuReport(imu);
        	s_last_imu_ok_tick = uwTick;
        }

