mkaradeli/Metu-X-stm32/CM7/app/app_main.cpp
    }
//    float R[3][3]; quatToR(q, R);
	if(lidar.hasNewReading()) {

		onLidarFrame(lidar.getDistance(), lidar.getStrength());
		s_last_lidar_ok_tick = uwTick;
	}
	if (baro.hasNewReading()) {
		g_altEst.pushBaroFrame(baro.getPressurePa());
		HilNavPushBaro(&g_denizNav, baro.getHeightM(), baro.getPressurePa(), micros() * 1e-6, 1);
	}
//    float aw[3];
//    for (int i = 0; i < 3; ++i)
//        aw[i] = R[i][0]*a_b[0] + R[i][1]*a_b[1] + R[i][2]*a_b[2];
    kf_profiler.end();


    if (task_ready(&heartbeat_task))
    	  		LED_Counter_Tick();
//    missionControl.HandleCommand(rx_line, reply, sizeof(reply))
    // TODO: recive handling

#if HWIL_ENABLED
    /* No "active" flag on the model itself, so gate it externally: only
     * step (and only bother feeding it inputs) while a mission is actually
     * running, so the simulated rocket doesn't integrate motion while idle
     * on the bench pre-arm. */
    hwil_profiler.start();
    if (missionControl.firing) {
        hwil.rtU.F_nozzle_1 = actuator[0].actuatorController.rtY.ThrustEstimate;
        hwil.rtU.F_nozzle_2 = actuator[1].actuatorController.rtY.ThrustEstimate;
        hwil.rtU.F_nozzle_3 = actuator[2].actuatorController.rtY.ThrustEstimate;
        hwil.rtU.F_nozzle_4 = actuator[3].actuatorController.rtY.ThrustEstimate;
        hwil.rtU.P_nozzle_manifold = Actuator::manifold->getPsi();
        hwil.rtU.P_nozzle_1 = actuator[0].getPressurePsi();
        hwil.rtU.P_nozzle_2 = actuator[1].getPressurePsi();
        hwil.rtU.P_nozzle_3 = actuator[2].getPressurePsi();
        hwil.rtU.P_nozzle_4 = actuator[3].getPressurePsi();
        hwil.rtU.quaternion_true[0] = imu.gyroIntegratedRV.i;
        hwil.rtU.quaternion_true[1] = imu.gyroIntegratedRV.j;
        hwil.rtU.quaternion_true[2] = imu.gyroIntegratedRV.k;
        hwil.rtU.quaternion_true[3] = imu.gyroIntegratedRV.real;
        hwil.step();
    }
    hwil_profiler.end();
#endif

	tim7_profiler.end();
}

void tim12_trigger(){ // mid priority 1000hz platform control task
	tim12_profiler.start();
//	platform_controller.rtU.Height = altEstimator.altitude(); // m
//	platform_controller.rtU.Velocity = altEstimator.velocity(); // m/s
	platform_controller.rtU.ManifoldPressure = Actuator::manifold->getBar(); // bar -- real either way, HWIL has no manifold output
#if HWIL_ENABLED
	platform_controller.rtU.quaternion[0] = hwil.rtY.quaternion_sim[0];
	platform_controller.rtU.quaternion[1] = hwil.rtY.quaternion_sim[1];
	platform_controller.rtU.quaternion[2] = hwil.rtY.quaternion_sim[2];
	platform_controller.rtU.quaternion[3] = hwil.rtY.quaternion_sim[3];
	platform_controller.rtU.Height = hwil.rtY.position;
	platform_controller.rtU.Velocity = hwil.rtY.velocity;
	platform_controller.rtU.gyro[0] = hwil.rtY.angular_velocity[0];
	platform_controller.rtU.gyro[1] = hwil.rtY.angular_velocity[1];
	platform_controller.rtU.gyro[2] = hwil.rtY.angular_velocity[2];

#else
	platform_controller.rtU.quaternion[0] = imu.gyroIntegratedRV.i;
	platform_controller.rtU.quaternion[1] = imu.gyroIntegratedRV.j;
	platform_controller.rtU.quaternion[2] = imu.gyroIntegratedRV.k;
	platform_controller.rtU.quaternion[3] = imu.gyroIntegratedRV.real;
	// Full Kalman fusion (lidar + baro + IMU, with tilt/obstruction/NIS
	// gating) -- see AltitudeEstimator. Was a raw lidar-only bypass while
	// the filter itself was still being debugged; switched back now that
	// it's dependable.
	platform_controller.rtU.Height = g_altEst.height();
	platform_controller.rtU.Velocity = g_altEst.velocity();
	platform_controller.rtU.gyro[0] = imu.gyroIntegratedRV.angVelX;
	platform_controller.rtU.gyro[1] = imu.gyroIntegratedRV.angVelY;
	platform_controller.rtU.gyro[2] = imu.gyroIntegratedRV.angVelZ;
#endif
//	platform_controller.rtU.T_alloc_total = T_alloc_total;


	float T_alloc_total  = 0;
	for (int i=0; i<4; i++) T_alloc_total += actuator[i].actuatorController.rtY.ThrustEstimate;
	float T_max_allowed  = 0;
	for (int i=0; i<4; i++) T_max_allowed += actuator[i].actuatorController.rtY.ThrustMax;

	platform_controller.rtU.T_alloc_total = T_alloc_total;
	platform_controller.rtU.T_max_allowed = T_max_allowed;

	// TODO: add drop, and force relationships.
//	platform_controller.rtU.Dropped = ;
	if (missionControl.firing)
		platform_controller.step();
	tim12_profiler.end();
}

void current_adc_complete(){
	adc2_profiler.start();
	for (int i=0; i<4; i++){
		actuator[i].updateCurrent(adc_dma_buf_current[i]);
	}
	for (int i=0; i<4; i++)
		actuator[i].current_controller_step();
	adc2_profiler.end();
}

void encoder_adc_complete(){
	adc1_profiler.start();
	for (int i=0; i<4; i++){
		actuator[i].updateHallEffect();
	}
	adc1_profiler.end();
}
bool accept_log_entry=false;
static uint32_t log_tick = 0;
void pressure_adc_complete(){
	adc3_profiler.start();
	for (int i=0; i<4; i++){
		actuator[i].readPressure();
	}
	Actuator::manifold->updatePS();
//	loadCell.update();

    missionControl.Iter();

//    altEstimator.setClamped(!missionControl.firing);   // was: !missionControl.running

//	altEstimator.setClamped(!missionControl.running);

	for (int i=0; i<4; i++) {
		actuator[i].actuator_controller_step();
	}
	battery_voltage = static_cast<float>(adc_dma_buf_pressure[5])/65536.0f *3.3f *21.0f;
	// External inputs (root inport signals with default storage)
//	struct ExtU {
	//  real32_T P_manifold;             // '<Root>/P_manifold'
//	  real32_T P_nozzle_demand_ext;    // '<Root>/P_nozzle_demand_ext'
	//  real32_T P_nozzle;               // '<Root>/P_nozzle'
	//  real32_T SpeedFeedback;          // '<Root>/speed_feedback'
//	  real32_T pos_ref_ext;            // '<Root>/pos_ref_ext'
	//  real32_T pos_feedback;           // '<Root>/pos_feedback'
//	  real32_T speedDemand_ext;        // '<Root>/speedDemand_ext'
	//  real32_T ValveFitPressureRatios[11];// '<Root>/ValveFitPressureRatios'
//	  real32_T F_demand;               // '<Root>/F_demand'
	//  real32_T nozzle_gain;            // '<Root>/nozzle_gain'
//	};/

	// External outputs (root outports fed by signals with default storage)
	log_tick++;
	accept_log_entry = false;(logData.write_idx) < (LOG_HALF_RECORDS/2);
	accept_log_entry |= !(logData.half_full[0] || logData.half_full[1]);
	accept_log_entry |= ((log_tick%2) == 0);
	if (accept_log_entry) {

