mkaradeli/Metu-X-stm32/CM7/app/app_main.cpp
	local_sensor_data.timestamp = micros(); //microseconds
	for (int j=0;j<4;j++){

		local_sensor_data.actuatorData[j].current_measured = actuator[j].get_current();
		local_sensor_data.actuatorData[j].current_demand = actuator[j].actuatorController.rtY.currentDemand;
		local_sensor_data.actuatorData[j].speedDemand = actuator[j].actuatorController.rtY.speedDemand;
		local_sensor_data.actuatorData[j].pos_ref = actuator[j].actuatorController.rtY.position_demand;
		local_sensor_data.actuatorData[j].pos_ref_rate_limited = actuator[j].actuatorController.rtY.pos_ref_rate_limited;
		local_sensor_data.actuatorData[j].speed_ref_rate_limited = actuator[j].actuatorController.rtY.speedDemand;
		local_sensor_data.actuatorData[j].pressure_demand = actuator[j].actuatorController.rtY.P_nozzle_demand1;
		local_sensor_data.actuatorData[j].valveAngle = actuator[j].hallEffect.valveAngle;
		local_sensor_data.actuatorData[j].valveAngleKalman = actuator[j].hallEffect.valveAngleKalman;
		local_sensor_data.actuatorData[j].valveVelocity = actuator[j].hallEffect.valveVelocity;
		local_sensor_data.actuatorData[j].duty = actuator[j].getDutyCycle();
		local_sensor_data.actuatorData[j].nozzle_pressure = actuator[j].getPressurePsi();
		local_sensor_data.actuatorData[j].thrust_demand = actuator[j].actuatorController.rtU.F_demand;
		local_sensor_data.actuatorData[j].thrust_estimated = actuator[j].actuatorController.rtY.ThrustEstimate;

	}
		local_sensor_data.manifold_pressure = Actuator::manifold->getPsi();
#if HWIL_ENABLED
//		for (int i = 0; i <3; i++)
		local_sensor_data.linearAccel.x = hwil.rtY.acceleration[0];   // real either way: HWIL has no 3-axis accel output to substitute
		local_sensor_data.linearAccel.y = hwil.rtY.acceleration[1];   // real either way: HWIL has no 3-axis accel output to substitute
		local_sensor_data.linearAccel.z = hwil.rtY.acceleration[2];   // real either way: HWIL has no 3-axis accel output to substitute
		local_sensor_data.quaternion.i = hwil.rtY.quaternion_sim[0];
		local_sensor_data.quaternion.j = hwil.rtY.quaternion_sim[1];
		local_sensor_data.quaternion.k = hwil.rtY.quaternion_sim[2];
		local_sensor_data.quaternion.real = hwil.rtY.quaternion_sim[3];
		local_sensor_data.angularVelocity.x = hwil.rtY.angular_velocity[0];
		local_sensor_data.angularVelocity.y = hwil.rtY.angular_velocity[1];
		local_sensor_data.angularVelocity.z = hwil.rtY.angular_velocity[2];
#else
		local_sensor_data.angularVelocity.x = imu.gyroIntegratedRV.angVelX;
		local_sensor_data.angularVelocity.y = imu.gyroIntegratedRV.angVelY;
		local_sensor_data.angularVelocity.z = imu.gyroIntegratedRV.angVelZ;
//				local_sensor_data.angularVelocity.y = hwil.rtY.angular_velocity[1];
//				local_sensor_data.angularVelocity.z = hwil.rtY.angular_velocity[2];
		local_sensor_data.linearAccel = imu.accel;   // real either way: HWIL has no 3-axis accel output to substitute
		local_sensor_data.quaternion.i = imu.gyroIntegratedRV.i;
		local_sensor_data.quaternion.j = imu.gyroIntegratedRV.j;
		local_sensor_data.quaternion.k = imu.gyroIntegratedRV.k;
		local_sensor_data.quaternion.real = imu.gyroIntegratedRV.real;
#endif
		local_sensor_data.angularVelocityDemand.x = platform_controller.rtY.omega_demand[0];
		local_sensor_data.angularVelocityDemand.y = platform_controller.rtY.omega_demand[1];
		local_sensor_data.angularVelocityDemand.z = platform_controller.rtY.omega_demand[2];
		local_sensor_data.lidarDistance = lidar.getDistance();
		local_sensor_data.lidarStrength = lidar.getStrength();

#if HWIL_ENABLED
		local_sensor_data.kf_altitude = hwil.rtY.position;
		local_sensor_data.kf_velocity = hwil.rtY.velocity;
#else
		local_sensor_data.kf_altitude = g_altEst.height();
		local_sensor_data.kf_velocity = g_altEst.velocity();
#endif

        local_sensor_data.actuator_mode = static_cast<uint8_t>(controller_mode);
        local_sensor_data.mission_modes = static_cast<uint8_t>(mission_mode);
        local_sensor_data.system_modes = static_cast<uint8_t>(missionControl.system_mode);
        local_sensor_data.last_error   = static_cast<uint8_t>(missionControl.last_error);
        local_sensor_data.go_no_go_status  = go_no_go_status;
        local_sensor_data.go_no_go_enabled = missionControl.go_no_go_enabled;
        local_sensor_data.battery_voltage = battery_voltage;
        local_sensor_data.baro_ambientTemp = baro.getTemperatureC();
        local_sensor_data.baro_pressure = baro.getPressurePa();
        local_sensor_data.baro_height = baro.getHeightM();

        local_sensor_data.velocity_target = platform_controller.rtY.V_target;
        local_sensor_data.acceleration_feedforward = platform_controller.rtY.a_ff;
        local_sensor_data.acceleration_command = platform_controller.rtY.a_cmd;
        local_sensor_data.vertical_thrust_command = platform_controller.rtY.VerticalThrustCmd;
        local_sensor_data.denizHeight = static_cast<float>(g_denizNav.X[HILNAV_H]);
        local_sensor_data.denizVelocity = static_cast<float>(g_denizNav.X[HILNAV_V]);

//        float ambientTemp;
//        	float pressure;
//        	float height;


		if(task_ready(&uart_logging)){
#if not ENABLE_PRINT
			if (!ymodem_active()) {
				rb_write(&common_print_buffer, &local_sensor_data, (size_t)sizeof(SensorData_t));
			}
#endif
		}

		if (missionControl.running and logData.ready) {
		    SensorData_t *slot = SensorData_Buffer_Reserve(&logData);
		if (slot){
			*slot = local_sensor_data;
			crc_profiler.start();
			slot->crc = crc16_calc((uint8_t*)slot, sizeof(SensorData_t) - 2);
			crc_profiler.end();
			last_valid_sensor_data = slot;
			SensorData_Buffer_Commit(&logData);
		}
	}
	}

	adc3_profiler.end();
}

void HAL_I2C_MemRxCpltCallback(I2C_HandleTypeDef *hi2c) {
	if (hi2c == &hi2c4) {
		baro_profiler.start();
		baro.onReadComplete();  // next startRead() is re-armed from tim7_trigger()'s baro_task
		baro_profiler.end();
	}
}
void HAL_I2C_ErrorCallback(I2C_HandleTypeDef *hi2c) {
	if (hi2c == &hi2c4) {
		baro.onReadError();
	}
}

void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size){
	if (huart == &huart6){
		lidar_profiler.start();
//		printf("aaaa lidar frame captured!\n\r");
		lidar.FrameHandler(Size);
//		if (lidar.hasNewReading()) altEstimator.onLidarFrame(lidar.getDistance(), lidar.getStrength());

		HAL_UARTEx_ReceiveToIdle_DMA(&huart6, lidar.getBuffer(), 128);  // re-arm!
		lidar_profiler.end();
	}
}
void HAL_UART_ErrorCallback(UART_HandleTypeDef* huart) {
    if (huart == &huart6){
        HAL_UARTEx_ReceiveToIdle_DMA(&huart6, lidar.getBuffer(), 128);  // recover
    }
    if (huart == s_huart) {
        rb_tx_error_isr();
    }
    mission_uart_error(huart);        // no-op unless it is the command UART
}
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	if (huart == s_huart) {
		rb_tx_complete_isr();
	}
//	imu.quaternionInterval_us
}

void onImuReport(const BNO085& r) {
    // accelInterval_us is ALREADY the elapsed time since the last accel
    // report (see BNO085::eventListener, "stamp - lastAccelStamp_us_") --
    // it's a dt in microseconds, not a running timestamp. Previously this
    // took a second difference against the last call's value, which -- for
    // a near-constant ~5000us interval at steady 200 Hz -- collapsed to
    // jitter noise close to zero, and pushImu() drops any dt <= 0, so most
    // predict() calls were silently skipped.
    const float dt = imu.accelInterval_us * 1e-6f;

    const float q[4] = { r.gyroIntegratedRV.real, r.gyroIntegratedRV.i, r.gyroIntegratedRV.j, r.gyroIntegratedRV.k };
    const float a[3] = { r.accel.x, r.accel.y, r.accel.z };
    g_altEst.pushImu(a, q, dt);

    // Deniz's HilNav, driven off the same samples, logged only -- see globals.hpp.
    const double denizQ[4] = { q[0], q[1], q[2], q[3] };
    const double denizA[3] = { a[0], a[1], a[2] };
    const double denizW[3] = { r.gyroIntegratedRV.angVelX, r.gyroIntegratedRV.angVelY, r.gyroIntegratedRV.angVelZ };
    HilNavPushImu(&g_denizNav, denizQ, denizA, denizW, micros() * 1e-6, 1);
}
void onLidarFrame(uint16_t distMm, uint16_t strength) {
    const float q[4] = { imu.gyroIntegratedRV.real, imu.gyroIntegratedRV.i,
                         imu.gyroIntegratedRV.j,    imu.gyroIntegratedRV.k };
    g_altEst.pushLidarFrame(distMm, strength, q);

    HilNavPushRange(&g_denizNav, distMm * 0.001, strength, micros() * 1e-6, 1);

    if (g_altEst.hasNewProjectedHeight()) {
        static float    s_prevHeight = 0.0f;
        static uint64_t s_prevTimeUs = 0;
        static bool     s_havePrev   = false;

        const float    h   = g_altEst.lastProjectedHeight();
        const uint64_t now = micros();

