mkaradeli/Metu-X-stm32/CM7/app/app_main.cpp
        if (s_havePrev) {
            const float dt = static_cast<float>(now - s_prevTimeUs) * 1e-6f;
            if (dt > 0.0f && dt < 0.1f) {   // sanity bound, same as pushImu()'s
                lidarDerivedVelocity = (h - s_prevHeight) / dt;
            }
        }
        s_prevHeight = h;
        s_prevTimeUs = now;
        s_havePrev   = true;
    }
}
void LED_Counter_Tick(void)
{
	static const uint8_t timing[] = {1, 0, 1, 0, 0, 0, 0};
	static const uint8_t timing_logging[]= {1, 0, 1, 0, 1, 0, 0};
	static uint8_t index = 0;
	if (logData.record){
		if (timing_logging[index])
			BSP_LED_On(LED_GREEN);
		else
			BSP_LED_Off(LED_GREEN);
		}
	else {
		if (timing[index])
			BSP_LED_On(LED_GREEN);
		else
			BSP_LED_Off(LED_GREEN);
	}

	/* Yellow: on whenever the downlink isn't demonstrably working right now --
	 * either it just dropped a frame (frames_dropped ticking up) or nothing
	 * went out at all since the last check (frames_sent stalled -- covers a
	 * dead/hung radio that never even gets far enough to hit a retry-exhausted
	 * drop). Off only while frames are actually leaving clean. */
	static uint32_t lastFramesSent = 0;
	static uint32_t lastFramesDropped = 0;
	bool sentProgress = (nrf24_frame_stats.frames_sent != lastFramesSent);
	bool droppingNow  = (nrf24_frame_stats.frames_dropped != lastFramesDropped);
	lastFramesSent    = nrf24_frame_stats.frames_sent;
	lastFramesDropped = nrf24_frame_stats.frames_dropped;

	if (sentProgress && !droppingNow)
		BSP_LED_Off(LED_YELLOW);
	else
		BSP_LED_On(LED_YELLOW);

	/* Go/no-go: recompute which of the 7 gated subsystems are currently
	 * healthy. See MissionControl::Start(), which ANDs this against
	 * missionControl.go_no_go_enabled before allowing an arm. */
	{
		uint8_t status = 0;

		if ((uwTick - s_last_imu_ok_tick) < IMU_STALE_MS)
			status |= GoNoGo::IMU;
		if ((uwTick - s_last_lidar_ok_tick) < LIDAR_STALE_MS)
			status |= GoNoGo::LIDAR;

		bool pressure_ok = true;
		for (int i = 0; i < 5; i++)
			if (adc_dma_buf_pressure[i] < 4000 or adc_dma_buf_pressure[i]>60000) pressure_ok = false;
		if (pressure_ok) status |= GoNoGo::PRESSURE;

		if (logData.ready) status |= GoNoGo::SD_CARD;

		if (sentProgress && !droppingNow) status |= GoNoGo::TELEMETRY;

		bool current_ok = true;
		for (int i = 0; i < 4; i++)
			if (adc_dma_buf_current[i] < 4000 or adc_dma_buf_current[i] > 60000) current_ok = false;
		if (current_ok) status |= GoNoGo::CURRENT;

		if (adc_dma_buf_pressure[5] >= BATTERY_RAW_MIN) status |= GoNoGo::BATTERY;

		go_no_go_status = status;
	}

	index ++;
	index %= 7;
}

uint16_t crc16_calc(const uint8_t *p, size_t n)
{
#if DISABLE_CRC
	return LOG_TERMINATOR;
//	return (uint16_t) '\n\r';
#else
    CRC->CR |= CRC_CR_RESET;               // reload INIT (0xFFFF), self-clears
    while (n--)
        *(volatile uint8_t *)&CRC->DR = *p++;   // STRB: byte-wide feed
    return (uint16_t)CRC->DR;
#endif
}
